comandos basicos del uso de pandas en python

In [2]:
import pandas as pd

creemos un dict que nos permitira crear un dataframe  
dos columnas, apple and orange   
y luego las lineas indican la cantidad comprada por cada cliente

In [9]:
data = {
    'apples' : [3, 2, 0, 1],
    'oranges' : [0, 3, 7, 2]
}

y ahora se lo pasamos al constructor de dataframes de pandas

In [11]:
purchases = pd.DataFrame(data)

In [12]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

the index is automatic.  
however we can choose our own

In [14]:
purchases = pd.DataFrame(data, index=['Julian', 'Penelope', 'Ramon', 'Bob'])

In [15]:
purchases

          apples  oranges
Julian         3        0
Penelope       2        3
Ramon          0        7
Bob            1        2

now we can locate customers orders using their name  
and the loc function

In [18]:
purchases.loc['Julian']

apples     3
oranges    0
Name: Julian, dtype: int64

* now lets try to read a csv file

In [19]:
df = pd.read_csv('titanic.csv')

In [20]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

we can also select which column to make the index

In [ ]:
df = pd.read_csv('purchases.csv', index_col=0)

we can also use pandas to read json

df = pd.read_json('purchases.json')

if you’re working with data from a SQL database you need to first establish a connection using an appropriate Python library, then pass a query to pandas.

!pip install pysqlite3

import sqlite3

con = sqlite3.connect("database.db")

df = pd.read_sql_query("SELECT * FROM purchases", con)

## tip  
si te conectas a PostgreSQL, MySQL, o cualquier otro servidor SQL, debes utilizar la libreria the python correcta. por ejemplo, `psycopg2` [link](http://initd.org/psycopg/download/) es para hacer conexiones a PostgreSQL.   
tambien ten en cuenta que te conectas al URI de la base de datos en ves de un archivo, como se muestra en el ejemplo anterior

### Convertir de un tipo a otro - json a csv o sql

df.to_csv('new_purchases.csv')

df.to_json('new_purchases.json')

df.to_sql('new_purchases', con)

### usemos un ejemplo concreto con la base de datos de IMDB

In [15]:
movies_df = pd.read_csv("IMDB-Movie-Data.csv", index_col="Title")

In [16]:
movies_df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [6]:
movies_df.tail(2)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

### informacion acerca del dataset

In [17]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

### shape te da un simple tuple con las dimensiones del dataset   
en este caso 1000 lineas con 11 columnas.  
fijate que shape no tiene parentesis

In [18]:
movies_df.shape

(1000, 11)

### borrar duplicados.  
es muy importante borrar los duplicados en un dataset.  
a modo de ejemplo vamos a duplicar la tabla y luego le diremos que borre los duplicados

In [21]:
temp_df = movies_df.append(movies_df)

temp_df.shape

(2000, 11)

In [20]:
temp_df = temp_df.drop_duplicates()

temp_df.shape

(1000, 11)

### utilizar inplace te ahorra usar una variable temporal
`inplace`

In [22]:
temp_df.drop_duplicates(inplace=True)

temp_df.shape

(1000, 11)

`drop_duplicates` tiene unos argumentos muy utiles.   
`first` (default) Elimina los duplicados excepto la primer ocurrencia   
`last` Elimina los duplicados except la ultima ocurrencia.  
`False` Elimina todos los duplicados

In [23]:
temp_df = movies_df.append(movies_df)  # crea una copia nueva

temp_df.drop_duplicates(inplace=True, keep=False)

temp_df.shape

(0, 11)

**en el ejemplo anterior se borraron todas las lineas**

### Limpiando las columnas

In [24]:
movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

### podemos renombrar columnas

In [25]:
movies_df.rename(columns={
    'Runtime (Minutes)': 'Runtime',
    'Revenue (Millions)': 'Revenue_millions'
}, inplace=True)

movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

### podemos volver minusculas todos los nombres de las columnas

In [26]:
movies_df.columns = [col.lower() for col in movies_df]

movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

### TIP.  
es una buena idea volver todos los titulos minusculas, retirar caracteres especiales y reemplazar espacios con barra al piso

### Manejo de valores vacios